SpenceKonde/DxCore/megaavr/variants/48pin-standard/pins_arduino.h
/*  (C) Spence Konde 2021 open source (LGPL2.1 see LICENSE.md) based on exisisting arduino cores.

 ###  #     # ####      ####   ###      # ####  ####      #  #  ###
#   # #     # #   #     #   # #   #    #  #   # #   #     #  # #   #          #
#####  #   #  ####      #   # #####   #   #   # ####      ####  ###  ### ###     ###
#   #   # #   #  #      #   # #   #  #    #   # #   #        # #   #     #  # #  #  #
#   #    #    #   #     ####  #   # #     ####  ####         #  ###      ###  #  #  #
=====================================================                    #
Variant definition file for generic DA/DB parts                          #
with 48 pins. AVR__DA48 and AVR__DB48, where the
blank is the flash space in kb. 128, 64, or 32.
This file may or may not be different for the
48-pin EA and other future parts. At present, I see
no need to add a separate set of variants for the
EA-series parts.
*/

/* Include guard and include basic libraries. We are normally including this inside Arduino.h */
#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <avr/pgmspace.h>
#include "timers.h"

/* Used for alternate pin mappings and special variants for specific boards. */
#define DEFAULT_48PIN_PINOUT

// Arduino pin macros
#define PIN_PA0 ( 0)
#define PIN_PA1 ( 1)
#define PIN_PA2 ( 2)
#define PIN_PA3 ( 3)
#define PIN_PA4 ( 4)
#define PIN_PA5 ( 5)
#define PIN_PA6 ( 6)
#define PIN_PA7 ( 7)
#define PIN_PB0 ( 8)
#define PIN_PB1 ( 9)
#define PIN_PB2 (10)
#define PIN_PB3 (11)
#define PIN_PB4 (12)
#define PIN_PB5 (13)
#define PIN_PC0 (14)
#define PIN_PC1 (15)
#define PIN_PC2 (16)
#define PIN_PC3 (17)
#define PIN_PC4 (18)
#define PIN_PC5 (19)
#define PIN_PC6 (20)
#define PIN_PC7 (21)
#define PIN_PD0 (22)
#define PIN_PD1 (23)
#define PIN_PD2 (24)
#define PIN_PD3 (25)
#define PIN_PD4 (26)
#define PIN_PD5 (27)
#define PIN_PD6 (28)
#define PIN_PD7 (29)
#define PIN_PE0 (30)
#define PIN_PE1 (31)
#define PIN_PE2 (32)
#define PIN_PE3 (33)
#define PIN_PF0 (34)
#define PIN_PF1 (35)
#define PIN_PF2 (36)
#define PIN_PF3 (37)
#define PIN_PF4 (38)
#define PIN_PF5 (39)
#define PIN_PF6 (40) /* RESET can be used as an input via fuse setting. It poses no reprogramming challenges, and has no output drivers. */
/*      PIN_PF7 (41) UPDI pin not available for alternative functions on DA/DB parts*/

#define PINS_COUNT                          (41)
#define NUM_DIGITAL_PINS                    PINS_COUNT
#define NUM_ANALOG_INPUTS                   (18)
#define NUM_RESERVED_PINS                   (0)
#define NUM_INTERNALLY_USED_PINS            (0)
#define NUM_I2C_PINS                        (2)
#define NUM_SPI_PINS                        (3)
#define NUM_TOTAL_FREE_PINS                 NUM_DIGITAL_PINS
#define NUM_TOTAL_PINS                      NUM_DIGITAL_PINS

#if !defined(LED_BUILTIN)
  #define LED_BUILTIN                       PIN_PA7
#endif
#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS           (47)
#endif


#define digitalPinToAnalogInput(p)          (((p) > PIN_PC7 && (p) < PIN_PF0) ? ((p) - PIN_PD0) : ((p) < PIN_PF6 ? ((p) - 18) : NOT_A_PIN))
#define analogChannelToDigitalPin(p)        (((p) < 12) ? ((p) + PIN_PD0) : (((p) < 16 || p > 21) ? NOT_A_PIN : ((p) + PIN_F0 - 16)))
#define analogInputToDigitalPin(p)                          analogChannelToDigitalPin((p) & 0x7F)
#define digitalOrAnalogPinToDigital(p)      (((p) & 0x80) ? analogChannelToDigitalPin((p) & 0x7f) : (((p)<=NUM_DIGITAL_PINS) ? (p) : NOT_A_PIN))

#define portToPinZero(port)                 (((port) < PF) ? (((port) * 8) - (((port) > 1) ? 2 : 0) : ((port) == PF ? PIN_PF0 : NOT_A_PIN))

// Timer pin swaps
#define TCA0_PINS PORTMUX_TCA0_PORTC_gc     // TCA0 output on PD[0:5] by default, vbut just write the portmux to change it
#define TCA1_PINS 0x00                      // TCA0 output on PB[0:5] (no pinswap, only swap is 3-pin only -> not supported by analogWrite())
#define TCB0_PINS PORTMUX_TCB0_bm           // TCB0 output on PF4 instead of PA2 (default)
#define TCB1_PINS PORTMUX_TCB1_bm           // TCB1 output on PF5 instead of PA3 (default)
#define TCB2_PINS 0x00                      // TCB2 output on PC0 (default) instead of PB4
#define TCB3_PINS PORTMUX_TCB3_bm           // TCB3 output on PC1 instead of PB5 (default)
#define TCD0_PINS PORTMUX_TCD0_DEFAULT_gc   // Only default port option works!

#if defined(MILLIS_USE_TIMERB0)
  #define digitalPinHasPWMTCB(p)            (((p) == PIN_PB4) || ((p) == PIN_PB5) || ((p) == PIN_PF5))
#elif defined(MILLIS_USE_TIMERB1)
  #define digitalPinHasPWMTCB(p)            (((p) == PIN_PB4) || ((p) == PIN_PB5) || ((p) == PIN_PF4))
#elif defined(MILLIS_USE_TIMERB2)
  #define digitalPinHasPWMTCB(p)            (((p) == PIN_PB5) || ((p) == PIN_PF4) || ((p) == PIN_PF5))
#elif defined(MILLIS_USE_TIMERB3)
  #define digitalPinHasPWMTCB(p)            (((p) == PIN_PB4) || ((p) == PIN_PF4) || ((p) == PIN_PF5))
#else //no TCB's are used for millis
  #define digitalPinHasPWMTCB(p)            (((p) == PIN_PB4) || ((p) == PIN_PB5) || ((p) == PIN_PF4) || ((p) == PIN_PF5))
#endif


#define PIN_TCA0_WO0_INIT PIN_PC0
#define PIN_TCA1_WO0_INIT PIN_PB0
#define PIN_TCD0_WOA_INIT PIN_PA4

#define USE_TIMERD0_PWM
#define NO_GLITCH_TIMERD0

#define digitalPinHasPWM(p)                (digitalPinHasPWMTCB(p) || ((p) >= PIN_PA4 && (p) <= PIN_PC5))

/*          ####   ###  ####  ##### #   # #   # #   #
            #   # #   # #   #   #   ## ## #   #  # #
            ####  #   # ####    #   # # # #   #   #
            #     #   # #  #    #   #   # #   #  # #
            #      ###  #   #   #   #   #  ###  #   */

#define SPI_INTERFACES_COUNT   1 /* 2 SPI peripherals but SPI.h only uses one at a time, see that readme for details.*/
#define NUM_HWSERIAL_PORTS     5

// SPI 0
#define SPI_MUX                         PORTMUX_SPI0_DEFAULT_gc
#define SPI_MUX_PINSWAP_1               PORTMUX_SPI0_ALT1_gc
#define PIN_SPI_MOSI                    PIN_PA4
#define PIN_SPI_MISO                    PIN_PA5
#define PIN_SPI_SCK                     PIN_PA6
#define PIN_SPI_SS                      PIN_PA7
#define PIN_SPI_MOSI_PINSWAP_1          PIN_PE0
#define PIN_SPI_MISO_PINSWAP_1          PIN_PE1
#define PIN_SPI_SCK_PINSWAP_1           PIN_PE2
#define PIN_SPI_SS_PINSWAP_1            PIN_PE3


// SPI 1
#define SPI1_MUX                        PORTMUX_SPI1_DEFAULT_gc
#define SPI1_MUX_PINSWAP_1              PORTMUX_SPI1_ALT1_gc
#define PIN_SPI1_MOSI                   PIN_PC0
#define PIN_SPI1_MISO                   PIN_PC1
#define PIN_SPI1_SCK                    PIN_PC2
#define PIN_SPI1_SS                     PIN_PA3
#define PIN_SPI1_MOSI_PINSWAP_1         PIN_PC4
#define PIN_SPI1_MISO_PINSWAP_1         PIN_PC5
#define PIN_SPI1_SCK_PINSWAP_1          PIN_PC6
#define PIN_SPI1_SS_PINSWAP_1           PIN_PC7


// TWI 0
#define PIN_WIRE_SDA                    PIN_PA2
#define PIN_WIRE_SCL                    PIN_PA3
#define PIN_WIRE_SDA_PINSWAP_1          PIN_PA2
#define PIN_WIRE_SCL_PINSWAP_1          PIN_PA3
#define PIN_WIRE_SDA_PINSWAP_2          PIN_PC2
#define PIN_WIRE_SCL_PINSWAP_2          PIN_PC3


// TWI 1
#define PIN_WIRE1_SDA                   PIN_PF2
#define PIN_WIRE1_SCL                   PIN_PF3
#define PIN_WIRE1_SDA_PINSWAP_1         PIN_PF2
#define PIN_WIRE1_SCL_PINSWAP_1         PIN_PF3
#define PIN_WIRE1_SDA_PINSWAP_2         PIN_PB2
#define PIN_WIRE1_SCL_PINSWAP_2         PIN_PB3

