SpenceKonde/DxCore/megaavr/variants/48pin-standard/pins_arduino.h
/*    ####  ### #   #      ###  ####  ####   ###  #   #  ###
      #   #  #  ##  #     #   # #   # #   # #   #  # #  #
      ####   #  # # #     ##### ####  ####  #####   #    ###
      #      #  #  ##     #   # #  #  #  #  #   #   #       #
      #     ### #   #     #   # #   # #   # #   #   #    #*/

#ifdef ARDUINO_MAIN
/* this guards against multiple definition errors, since this file gets included by everything,
   but only in one case should these tables be generated */
const uint8_t digital_pin_to_port[] = {
  PA,           //  0 PA0/USART0_Tx/XTAL0/CLKIN
  PA,           //  1 PA1/USART0_Rx/XTAL1
  PA,           //  2 PA2/SDA
  PA,           //  3 PA3/SCL
  PA,           //  4 PA4/MOSI
  PA,           //  5 PA5/MISO
  PA,           //  6 PA6/SCK
  PA,           //  7 PA7/SS/CLKOUT/LED_BUILTIN
  PB,           //  8 PB0/USART3_Tx
  PB,           //  9 PB1/USART3_Rx
  PB,           // 10 PB2
  PB,           // 11 PB3
  PB,           // 12 PB4/(TCB2 PWM)
  PB,           // 13 PB5
  PC,           // 14 PC0/USART1_Tx
  PC,           // 15 PC1/USART1_Rx
  PC,           // 16 PC2
  PC,           // 17 PC3
  PC,           // 18 PC4
  PC,           // 19 PC5
  PC,           // 20 PC6
  PC,           // 21 PC7
  PD,           // 22 PD0/AIN0
  PD,           // 23 PD1/AIN1
  PD,           // 24 PD2/AIN2
  PD,           // 25 PD3/AIN3
  PD,           // 26 PD4/AIN4
  PD,           // 27 PD5/AIN5
  PD,           // 28 PD6/AIN6
  PD,           // 29 PD7/AIN7/AREF
  PE,           // 30 PE0/AIN8
  PE,           // 31 PE1/AIN9
  PE,           // 32 PE2/AIN10
  PE,           // 33 PE3/AIN11
  PF,           // 34 PF0/AIN16/USART2_Tx/TOSC1
  PF,           // 35 PF1/AIN17/USART2_Rx/TOSC2
  PF,           // 36 PF2/AIN18
  PF,           // 37 PF3/AIN19
  PF,           // 38 PF4/AIN20
  PF,           // 39 PF5/AIN21
  PF,           // 40 PF6 RESET
  //PF,         // 41 PF7 (UPDI)
};
const uint8_t digital_pin_to_bit_position[] = {
  #if (CLOCK_SOURCE == 0 && !defined(XTAL_PINS_HARDWIRED)) // PA0 used for external clock and crystal.
  PIN0_bp,      //  0 PA0/USART0_Tx
  #else
  NOT_A_PIN,    //    PA0 XTAL0/CLKIN (used for external crystal or clock, or is hardwired to one and not broken out)
  #endif
  #if (CLOCK_SOURCE == 1 ||  defined(XTAL_PINS_HARDWIRED)) // PA1 also used for crystal
  NOT_A_PIN,    //    PA1 XTAL1  (used for external crystal, or is hardwired to one and not broken out)
  #else
  PIN1_bp,      //  1 PA1/USART0_Rx
  #endif
  PIN2_bp,      //  2 PA2/SDA
  PIN3_bp,      //  3 PA3/SCL
  PIN4_bp,      //  4 PA4/MOSI
  PIN5_bp,      //  5 PA5/MISO
  PIN6_bp,      //  6 PA6/SCK
  PIN7_bp,      //  7 PA7/SS/CLKOUT
  PIN0_bp,      //  8 PB0/USART3_Tx
  PIN1_bp,      //  9 PB1/USART3_Rx
  PIN2_bp,      // 10 PB2
  PIN3_bp,      // 11 PB3
  PIN4_bp,      // 12 PB4/(TCB2 PWM)
  PIN5_bp,      // 13 PB5
  PIN0_bp,      // 14 PC0/USART1_Tx
  PIN1_bp,      // 15 PC1/USART1_Rx
  PIN2_bp,      // 16 PC2
  PIN3_bp,      // 17 PC3
  PIN4_bp,      // 18 PC4
  PIN5_bp,      // 19 PC5
  PIN6_bp,      // 20 PC6
  PIN7_bp,      // 21 PC7
  PIN0_bp,      // 22 PD0/AIN0
  PIN1_bp,      // 23 PD1/AIN1
  PIN2_bp,      // 24 PD2/AIN2
  PIN3_bp,      // 25 PD3/AIN3
  PIN4_bp,      // 26 PD4/AIN4
  PIN5_bp,      // 27 PD5/AIN5
  PIN6_bp,      // 28 PD6/AIN6
  PIN7_bp,      // 29 PD7/AIN7/AREF
  PIN0_bp,      // 30 PE0/AIN8
  PIN1_bp,      // 31 PE1/AIN9
  PIN2_bp,      // 32 PE2/AIN10
  PIN3_bp,      // 33 PE3/AIN11
  PIN0_bp,      // 34 PF0/USART2_Tx/TOSC1
  PIN1_bp,      // 35 PF1/USART2_Rx/TOSC2
  PIN2_bp,      // 36 PF2/AIN12
  PIN3_bp,      // 37 PF3/AIN13
  PIN4_bp,      // 38 PF4/AIN14
  PIN5_bp,      // 39 PF5/AIN15/LED_BUILTIN
  PIN6_bp,      // 40 PF6 RESET
  //PIN7_bm,    // 41 PF7 (UPDI)
};
const uint8_t digital_pin_to_bit_mask[] = {
  #if (CLOCK_SOURCE == 0 && !defined(XTAL_PINS_HARDWIRED)) // PA0 used for external clock and crystal.
  PIN0_bm,      //  0 PA0/USART0_Tx
  #else
  NOT_A_PIN,    //    PA0 XTAL0/CLKIN (used for external crystal or clock, or is hardwired to one and not broken out)
  #endif
  #if (CLOCK_SOURCE == 1 ||  defined(XTAL_PINS_HARDWIRED)) // PA1 also used for crystal
  NOT_A_PIN,    //    PA1 XTAL1  (used for external crystal, or is hardwired to one and not broken out)
  #else
  PIN1_bm,      //  1 PA1/USART0_Rx
  #endif
  PIN2_bm,      //  2 PA2/SDA
  PIN3_bm,      //  3 PA3/SCL
  PIN4_bm,      //  4 PA4/MOSI
  PIN5_bm,      //  5 PA5/MISO
  PIN6_bm,      //  6 PA6/SCK
  PIN7_bm,      //  7 PA7/SS/CLKOUT
  PIN0_bm,      //  8 PB0/USART3_Tx
  PIN1_bm,      //  9 PB1/USART3_Rx
  PIN2_bm,      // 10 PB2
  PIN3_bm,      // 11 PB3
  PIN4_bm,      // 12 PB4/(TCB2 PWM)
  PIN5_bm,      // 13 PB5
  PIN0_bm,      // 14 PC0/USART1_Tx
  PIN1_bm,      // 15 PC1/USART1_Rx
  PIN2_bm,      // 16 PC2
  PIN3_bm,      // 17 PC3
  PIN4_bm,      // 18 PC4
  PIN5_bm,      // 19 PC5
  PIN6_bm,      // 20 PC6
  PIN7_bm,      // 21 PC7
  PIN0_bm,      // 22 PD0/AIN0
  PIN1_bm,      // 23 PD1/AIN1
  PIN2_bm,      // 24 PD2/AIN2
  PIN3_bm,      // 25 PD3/AIN3
  PIN4_bm,      // 26 PD4/AIN4
  PIN5_bm,      // 27 PD5/AIN5
  PIN6_bm,      // 28 PD6/AIN6
  PIN7_bm,      // 29 PD7/AIN7/AREF
  PIN0_bm,      // 30 PE0/AIN8
  PIN1_bm,      // 31 PE1/AIN9
  PIN2_bm,      // 32 PE2/AIN10
  PIN3_bm,      // 33 PE3/AIN11
  PIN0_bm,      // 34 PF0/USART2_Tx/TOSC1
  PIN1_bm,      // 35 PF1/USART2_Rx/TOSC2
  PIN2_bm,      // 36 PF2/AIN12
  PIN3_bm,      // 37 PF3/AIN13
  PIN4_bm,      // 38 PF4/AIN14
  PIN5_bm,      // 39 PF5/AIN15/LED_BUILTIN
  PIN6_bm,      // 40 PF6 RESET
  //PIN7_bm,    // 55 PF7 (UPDI)
};
const uint8_t digital_pin_to_timer[] = {
  NOT_ON_TIMER,   //  0 PA0/USART0_Tx/CLKIN
  NOT_ON_TIMER,   //  1 PA1/USART0_Rx
  NOT_ON_TIMER,   //  2 PA2/SDA
  NOT_ON_TIMER,   //  3 PA3/SCL
  TIMERD0,        //  4 PA4/MOSI      WOA
  TIMERD0,        //  5 PA5/MISO      WOB
  TIMERD0,        //  6 PA6/SCK       WOC mirrors WOA
  TIMERD0,        //  7 PA7/SS/CLKOUT WOD mirrors WOB
  NOT_ON_TIMER,   //  8 PB0
  NOT_ON_TIMER,   //  9 PB1
  NOT_ON_TIMER,   // 10 PB2
  NOT_ON_TIMER,   // 11 PB3
  NOT_ON_TIMER,   // 12 PB4
  NOT_ON_TIMER,   // 13 PB5
  TIMERB2,        // 16 PC0
  TIMERB3,        // 17 PC1
  NOT_ON_TIMER,   // 18 PC2
  NOT_ON_TIMER,   // 19 PC3
  NOT_ON_TIMER,   // 20 PC4
  NOT_ON_TIMER,   // 21 PC5
  NOT_ON_TIMER,   // 20 PC6
  NOT_ON_TIMER,   // 21 PC7
  NOT_ON_TIMER,   // 22 PD0/AIN0
  NOT_ON_TIMER,   // 23 PD1/AIN1
  NOT_ON_TIMER,   // 24 PD2/AIN2
  NOT_ON_TIMER,   // 25 PD3/AIN3
  NOT_ON_TIMER,   // 26 PD4/AIN4
  NOT_ON_TIMER,   // 27 PD5/AIN5
  DACOUT,         // 28 PD6/AIN6
  NOT_ON_TIMER,   // 29 PD7/AIN7/AREF
  NOT_ON_TIMER,   // 30 PE0/AIN8
  NOT_ON_TIMER,   // 31 PE1/AIN9
  NOT_ON_TIMER,   // 32 PE2/AIN10
  NOT_ON_TIMER,   // 33 PE3/AIN11
  NOT_ON_TIMER,   // 34 PF0/USART2_Tx/TOSC1
  NOT_ON_TIMER,   // 35 PF1/USART2_Rx/TOSC2
  NOT_ON_TIMER,   // 36 PF2/AIN12
  NOT_ON_TIMER,   // 37 PF3/AIN13
  TIMERB0,        // 38 PF4/AIN14
  TIMERB1,        // 39 PF5/AIN15
  NOT_ON_TIMER,   // 40 PF6 RESET
  //NOT_ON_TIMER, // 55 PF7 (UPDI)
};

#endif

#endif
